
## Plan Result




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 2 to add, 5 to change, 7 to destroy.</code></pre>

* Update
  * azurerm_key_vault_secret.rd_prd_storage_account_name
  * azurerm_key_vault_secret.rd_prd_storage_account_primary_key
  * azurerm_key_vault_secret.rd_prd_storageaccount_id
  * azurerm_resource_group.rg
  * module.rd_key_vault.azurerm_monitor_diagnostic_setting.kv-ds
* Delete
  * module.rd_key_vault.azurerm_key_vault_access_policy.managed_identity_names_access_policy[&#34;civil&#34;]
  * module.rd_key_vault.azurerm_key_vault_access_policy.managed_identity_names_access_policy[&#34;et&#34;]
  * module.rd_key_vault.azurerm_key_vault_access_policy.managed_identity_names_access_policy[&#34;ia&#34;]
  * module.rd_key_vault.azurerm_key_vault_access_policy.managed_identity_names_access_policy[&#34;sptribs&#34;]
  * module.rd_key_vault.azurerm_key_vault_access_policy.managed_identity_names_access_policy[&#34;sscs&#34;]
* Replace
  * azurerm_storage_container.professional_data_service_container
  * module.storage_account_rd_professional.azurerm_storage_account.storage_account


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_key_vault_secret.rd_prd_storage_account_name will be updated in-place
  ~ resource "azurerm_key_vault_secret" "rd_prd_storage_account_name" {
        id                      = "https://rd-aat.vault.azure.net/secrets/rd-prd-storage-account-name/55840d7cec704ee2b7de5a2089540867"
        name                    = "rd-prd-storage-account-name"
        tags                    = {}
      ~ value                   = (sensitive value)
        # (5 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.rd_prd_storage_account_primary_key will be updated in-place
  ~ resource "azurerm_key_vault_secret" "rd_prd_storage_account_primary_key" {
        id                      = "https://rd-aat.vault.azure.net/secrets/rd-prd-storage-account-primary-key/90dae6a193af4c4ca9eabd34e93416cd"
        name                    = "rd-prd-storage-account-primary-key"
        tags                    = {}
      ~ value                   = (sensitive value)
        # (6 unchanged attributes hidden)
    }

  # azurerm_key_vault_secret.rd_prd_storageaccount_id will be updated in-place
  ~ resource "azurerm_key_vault_secret" "rd_prd_storageaccount_id" {
        id                      = "https://rd-aat.vault.azure.net/secrets/rd-prd-storage-account-id/7184e08de56345c18ea0835b13265662"
        name                    = "rd-prd-storage-account-id"
        tags                    = {}
      ~ value                   = (sensitive value)
        # (5 unchanged attributes hidden)
    }

  # azurerm_resource_group.rg will be updated in-place
  ~ resource "azurerm_resource_group" "rg" {
        id       = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/rd-aat"
        name     = "rd-aat"
      ~ tags     = {
          - "Destroy Me"   = "No"
          - "Team Contact" = "#referencedata"
          - "Team Name"    = "ReferenceData"
          - "application"  = "referencedata"
          - "builtFrom"    = "https://github.com/hmcts/rd-shared-infrastructure"
          - "businessArea" = "CFT"
          - "environment"  = "aat"
          - "lastUpdated"  = "2023-10-16T09:14:16Z"
          - "managedBy"    = "ReferenceData"
        } -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # azurerm_storage_container.professional_data_service_container must be replaced
-/+ resource "azurerm_storage_container" "professional_data_service_container" {
      ~ has_immutability_policy = false -> (known after apply)
      ~ has_legal_hold          = false -> (known after apply)
      ~ id                      = "https://rdcommondataaat.blob.core.windows.net/rd-prd-data" -> (known after apply)
      ~ metadata                = {} -> (known after apply)
        name                    = "rd-prd-data"
      ~ resource_manager_id     = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/rd-aat/providers/Microsoft.Storage/storageAccounts/rdcommondataaat/blobServices/default/containers/rd-prd-data" -> (known after apply)
      ~ storage_account_name    = "rdcommondataaat" -> "rdprofessionalaat" # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.rd_key_vault.azurerm_key_vault_access_policy.managed_identity_names_access_policy["civil"] will be destroyed
  # (because key ["civil"] is not in for_each map)
  - resource "azurerm_key_vault_access_policy" "managed_identity_names_access_policy" {
      - certificate_permissions = [] -> null
      - id                      = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/rd-aat/providers/Microsoft.KeyVault/vaults/rd-aat/objectId/05abbb96-02f6-4611-86b3-397bfe745479" -> null
      - key_permissions         = [] -> null
      - key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/rd-aat/providers/Microsoft.KeyVault/vaults/rd-aat" -> null
      - object_id               = "05abbb96-02f6-4611-86b3-397bfe745479" -> null
      - secret_permissions      = [
          - "Get",
          - "List",
        ] -> null
      - storage_permissions     = [] -> null
      - tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082" -> null
    }

  # module.rd_key_vault.azurerm_key_vault_access_policy.managed_identity_names_access_policy["et"] will be destroyed
  # (because key ["et"] is not in for_each map)
  - resource "azurerm_key_vault_access_policy" "managed_identity_names_access_policy" {
      - certificate_permissions = [] -> null
      - id                      = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/rd-aat/providers/Microsoft.KeyVault/vaults/rd-aat/objectId/38ba2508-87a5-48bb-9aa0-848510fb5c2a" -> null
      - key_permissions         = [] -> null
      - key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/rd-aat/providers/Microsoft.KeyVault/vaults/rd-aat" -> null
      - object_id               = "38ba2508-87a5-48bb-9aa0-848510fb5c2a" -> null
      - secret_permissions      = [
          - "Get",
          - "List",
        ] -> null
      - storage_permissions     = [] -> null
      - tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082" -> null
    }

  # module.rd_key_vault.azurerm_key_vault_access_policy.managed_identity_names_access_policy["ia"] will be destroyed
  # (because key ["ia"] is not in for_each map)
  - resource "azurerm_key_vault_access_policy" "managed_identity_names_access_policy" {
      - certificate_permissions = [] -> null
      - id                      = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/rd-aat/providers/Microsoft.KeyVault/vaults/rd-aat/objectId/0e01cdb4-6c67-48ac-8eac-b02443ed68d5" -> null
      - key_permissions         = [] -> null
      - key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/rd-aat/providers/Microsoft.KeyVault/vaults/rd-aat" -> null
      - object_id               = "0e01cdb4-6c67-48ac-8eac-b02443ed68d5" -> null
      - secret_permissions      = [
          - "Get",
          - "List",
        ] -> null
      - storage_permissions     = [] -> null
      - tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082" -> null
    }

  # module.rd_key_vault.azurerm_key_vault_access_policy.managed_identity_names_access_policy["sptribs"] will be destroyed
  # (because key ["sptribs"] is not in for_each map)
  - resource "azurerm_key_vault_access_policy" "managed_identity_names_access_policy" {
      - certificate_permissions = [] -> null
      - id                      = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/rd-aat/providers/Microsoft.KeyVault/vaults/rd-aat/objectId/c3481e83-d24c-4ddb-80c0-420a1327cb8a" -> null
      - key_permissions         = [] -> null
      - key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/rd-aat/providers/Microsoft.KeyVault/vaults/rd-aat" -> null
      - object_id               = "c3481e83-d24c-4ddb-80c0-420a1327cb8a" -> null
      - secret_permissions      = [
          - "Get",
          - "List",
        ] -> null
      - storage_permissions     = [] -> null
      - tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082" -> null
    }

  # module.rd_key_vault.azurerm_key_vault_access_policy.managed_identity_names_access_policy["sscs"] will be destroyed
  # (because key ["sscs"] is not in for_each map)
  - resource "azurerm_key_vault_access_policy" "managed_identity_names_access_policy" {
      - certificate_permissions = [] -> null
      - id                      = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/rd-aat/providers/Microsoft.KeyVault/vaults/rd-aat/objectId/8b014de8-5dd7-457c-b07e-2afc09a74062" -> null
      - key_permissions         = [] -> null
      - key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/rd-aat/providers/Microsoft.KeyVault/vaults/rd-aat" -> null
      - object_id               = "8b014de8-5dd7-457c-b07e-2afc09a74062" -> null
      - secret_permissions      = [
          - "Get",
          - "List",
        ] -> null
      - storage_permissions     = [] -> null
      - tenant_id               = "531ff96d-0ae9-462a-8d2d-bec7c0b42082" -> null
    }

  # module.rd_key_vault.azurerm_monitor_diagnostic_setting.kv-ds will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "kv-ds" {
        id                             = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/rd-aat/providers/Microsoft.KeyVault/vaults/rd-aat|rd-aat"
        name                           = "rd-aat"
        # (3 unchanged attributes hidden)

      - metric {
          - category = "AllMetrics" -> null
          - enabled  = false -> null

          - retention_policy {
              - days    = 0 -> null
              - enabled = false -> null
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.storage_account_rd_professional.azurerm_storage_account.storage_account must be replaced
-/+ resource "azurerm_storage_account" "storage_account" {
      ~ id                                = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/rd-aat/providers/Microsoft.Storage/storageAccounts/rdcommondataaat" -> (known after apply)
      + large_file_share_enabled          = (known after apply)
      ~ name                              = "rdcommondataaat" -> "rdprofessionalaat" # forces replacement
      ~ primary_access_key                = (sensitive value)
      ~ primary_blob_connection_string    = (sensitive value)
      ~ primary_blob_endpoint             = "https://rdcommondataaat.blob.core.windows.net/" -> (known after apply)
      ~ primary_blob_host                 = "rdcommondataaat.blob.core.windows.net" -> (known after apply)
      ~ primary_connection_string         = (sensitive value)
      ~ primary_dfs_endpoint              = "https://rdcommondataaat.dfs.core.windows.net/" -> (known after apply)
      ~ primary_dfs_host                  = "rdcommondataaat.dfs.core.windows.net" -> (known after apply)
      ~ primary_file_endpoint             = "https://rdcommondataaat.file.core.windows.net/" -> (known after apply)
      ~ primary_file_host                 = "rdcommondataaat.file.core.windows.net" -> (known after apply)
      ~ primary_location                  = "uksouth" -> (known after apply)
      ~ primary_queue_endpoint            = "https://rdcommondataaat.queue.core.windows.net/" -> (known after apply)
      ~ primary_queue_host                = "rdcommondataaat.queue.core.windows.net" -> (known after apply)
      ~ primary_table_endpoint            = "https://rdcommondataaat.table.core.windows.net/" -> (known after apply)
      ~ primary_table_host                = "rdcommondataaat.table.core.windows.net" -> (known after apply)
      ~ primary_web_endpoint              = "https://rdcommondataaat.z33.web.core.windows.net/" -> (known after apply)
      ~ primary_web_host                  = "rdcommondataaat.z33.web.core.windows.net" -> (known after apply)
      ~ secondary_access_key              = (sensitive value)
      + secondary_blob_connection_string  = (sensitive value)
      + secondary_blob_endpoint           = (known after apply)
      + secondary_blob_host               = (known after apply)
      ~ secondary_connection_string       = (sensitive value)
      + secondary_dfs_endpoint            = (known after apply)
      + secondary_dfs_host                = (known after apply)
      + secondary_file_endpoint           = (known after apply)
      + secondary_file_host               = (known after apply)
      + secondary_location                = (known after apply)
      + secondary_queue_endpoint          = (known after apply)
      + secondary_queue_host              = (known after apply)
      + secondary_table_endpoint          = (known after apply)
      + secondary_table_host              = (known after apply)
      + secondary_web_endpoint            = (known after apply)
      + secondary_web_host                = (known after apply)
        tags                              = {
            "Team Contact"        = "#referencedata"
            "application"         = "reference-data"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/rd-shared-infrastructure.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#ref-data-support"
            "environment"         = "staging"
            "managedBy"           = "Reference Data"
        }
        # (19 unchanged attributes hidden)

      ~ blob_properties {
          ~ change_feed_enabled           = false -> (known after apply)
          ~ change_feed_retention_in_days = 0 -> (known after apply)
          + default_service_version       = (known after apply)
          ~ last_access_time_enabled      = false -> (known after apply)
          ~ versioning_enabled            = false -> (known after apply)

          + container_delete_retention_policy {
              + days = (known after apply)
            }

          + cors_rule {
              + allowed_headers    = (known after apply)
              + allowed_methods    = (known after apply)
              + allowed_origins    = (known after apply)
              + exposed_headers    = (known after apply)
              + max_age_in_seconds = (known after apply)
            }

          + delete_retention_policy {
              + days = (known after apply)
            }

          + restore_policy {
              + days = (known after apply)
            }
        }

      ~ network_rules {
          ~ ip_rules                   = [] -> (known after apply)
            # (3 unchanged attributes hidden)
        }

      ~ queue_properties {
          + cors_rule {
              + allowed_headers    = (known after apply)
              + allowed_methods    = (known after apply)
              + allowed_origins    = (known after apply)
              + exposed_headers    = (known after apply)
              + max_age_in_seconds = (known after apply)
            }

          ~ hour_metrics {
              ~ enabled               = true -> (known after apply)
              ~ include_apis          = true -> (known after apply)
              ~ retention_policy_days = 31 -> (known after apply)
              ~ version               = "1.0" -> (known after apply)
            }

          ~ logging {
              ~ delete                = true -> (known after apply)
              ~ read                  = true -> (known after apply)
              ~ retention_policy_days = 31 -> (known after apply)
              ~ version               = "1.0" -> (known after apply)
              ~ write                 = true -> (known after apply)
            }

          ~ minute_metrics {
              ~ enabled               = true -> (known after apply)
              ~ include_apis          = true -> (known after apply)
              ~ retention_policy_days = 5 -> (known after apply)
              ~ version               = "1.0" -> (known after apply)
            }
        }

      + routing {
          + choice                      = (known after apply)
          + publish_internet_endpoints  = (known after apply)
          + publish_microsoft_endpoints = (known after apply)
        }

      ~ share_properties {
          + cors_rule {
              + allowed_headers    = (known after apply)
              + allowed_methods    = (known after apply)
              + allowed_origins    = (known after apply)
              + exposed_headers    = (known after apply)
              + max_age_in_seconds = (known after apply)
            }

          ~ retention_policy {
              ~ days = 7 -> (known after apply)
            }

          + smb {
              + authentication_types            = (known after apply)
              + channel_encryption_type         = (known after apply)
              + kerberos_ticket_encryption_type = (known after apply)
              + multichannel_enabled            = (known after apply)
              + versions                        = (known after apply)
            }
        }
    }

Plan: 2 to add, 5 to change, 7 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":171,"Program":"tfcmt","SHA1":"","Vars":{}} -->